implement-verify-service/test-results/java-repo/pipeline-output/java-design-patterns/test/diagrams/component-diagram.mmd
graph LR
    abstract_document["abstract-document"] --> java["java"]
    abstract_document["abstract-document"] --> com["com"]
    abstract_document["abstract-document"] --> lombok["lombok"]
    abstract_document["abstract-document"] --> org["org"]
    abstract_factory["abstract-factory"] --> lombok["lombok"]
    abstract_factory["abstract-factory"] --> org["org"]
    active_object["active-object"] --> java["java"]
    active_object["active-object"] --> org["org"]
    actor_model["actor-model"] --> java["java"]
    actor_model["actor-model"] --> lombok["lombok"]
    actor_model["actor-model"] --> org["org"]
    actor_model["actor-model"] --> com["com"]
    acyclic_visitor["acyclic-visitor"] --> lombok["lombok"]
